app/controllers/line_items_controller.rb

  def create
@cart = current_cart
product = Product.find(params[:product_id])
@line_item = @cart.add_product(product.id)
respond_to do |format|
if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-04-06 20:07:57.802697', '2011-04-06 20:07:57.802697')
INSERT INTO "line_items" ("updated_at", "quantity", "order_id", "cart_id", "product_id", "created_at") VALUES ('2011-05-31 13:57:12.898183', 1, NULL, 5, 2, '2011-05-31 13:57:12.898183')
UPDATE "line_items" SET "updated_at" = '2011-04-06 20:52:28.317734', "quantity" = 3 WHERE "line_items"."id" = 4