app/controllers/orders_controller.rb

SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 5)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 5)
---
  def new
	@cart = current_cart
	if @cart.line_items.empty?

INSERT INTO "orders" ("email", "address", "created_at", "name", "pay_type", "updated_at") VALUES ('üoiuhüiouh', 'ouhüouh', '2011-05-31 14:06:09.586950', 'iohiuoh', 'Credit card', '2011-05-31 14:06:09.586950')
DELETE FROM "carts" WHERE "carts"."id" = 6
---
  def create
    	@order = Order.new(params[:order])
	@order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
	Cart.destroy(session[:cart_id])